Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/out_computer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# BLE / NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# === POWER MANAGEMENT ===
# Compiled in but only activated at runtime during low-power mode
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3

# BLE controller modem sleep — radio powers down between BLE events
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y
CONFIG_BT_CTRL_LPCLK_SEL_MAIN_XTAL=y

# NimBLE host sleep support
CONFIG_BT_NIMBLE_SLEEP_ENABLE=y

# PHY power down during sleep
CONFIG_ESP_PHY_MAC_BB_PD=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Interrupt WDT
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300

# Core dump to flash — retrieve after crash with:
#   espcoredump.py info_corefile -t raw -c 0x610000 build/out_computer.elf
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
# (6.0 forces ELF format + SHA256 checksum; the legacy explicit ELF/CRC32
#  selectors are gone — CRC32 is unsupported on 6.0.)

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: new images boot as PENDING_VERIFY and auto-roll back to ota_0
# unless app calls esp_ota_mark_app_valid_cancel_rollback() after first
# successful telemetry round-trip. See docs/plans/08-ota-firmware-update.md §4.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

